# Data structure in python

Numbers

In [1]:
a,b,c=5,12.5,2+4j
print(type(a))
print(type(b))
print(type(c))

<class 'int'>
<class 'float'>
<class 'complex'>

In [2]:
import math

In [3]:
print(math.sqrt(4))
print(math.floor(11.9))
print(math.ceil(11.9))
print(math.pow(2,3))
print(math.factorial(5))
print(round(math.pi,4))

2.0
11
12
8.0
120
3.1416

In [4]:
area_of_circle=math.pi*10*10
print(area_of_circle)

314.1592653589793

In [5]:
import numpy as np
?np.sqrt

Strings

In [6]:
my_string = 'this is a string'
print(my_string)

"""ydry
ydry"""

my_string = """this is a string
which is 
multi  line"""
print(my_string)

this is a string
this is a string
which is
multi  line

 Slicing

In [7]:
my_string = "Python is a programming language.Python is interesting."

print(my_string[0])
print(my_string[-3])
print(my_string[0])
#[inclusive:exclusive]
print(my_string[3:10])
print(my_string[:20])
print(my_string[20:])
#length
print(len(my_string))
print(my_string[3],my_string[7])

P
n
P
hon is
Python is a programm
ing language.Python is interesting.
55
h i

In [8]:
#strings are immutable
my_string[3]="B"

TypeError: 'str' object does not support item assignment

In [9]:
my_string =my_string.replace("in","N")
print(my_string)

Python is a programmNg language.Python is NterestNg.

In [10]:
del my_string

List

In [11]:
# Python List

mylist1=[1,3,5,4,2]

mylist2 = [1, 4.2, "python" ,4.2]

print(mylist1)
print(mylist2)
print(type(mylist2))

[1, 3, 5, 4, 2]
[1, 4.2, 'python', 4.2]
<class 'list'>

In [12]:
a=[10,20,30,40,50,60,70,80]

print(a[3])
print(a[3:])
print(a[:3])
print(a[3],a[6])

40
[40, 50, 60, 70, 80]
[10, 20, 30]
40 70

In [13]:
#lists are mutable
#replacing an element on the basis of index number
a[3]="nikita"
print(a)

[10, 20, 30, 'nikita', 50, 60, 70, 80]

In [14]:
print(mylist2[2][1])

y

In [15]:
#appending multiple elements
my_list=[1,3,6,9]
my_list1=[1,2,3,[4,5,6],7,8]
my_new_list=[4,5,6,7,8]

my_list.append('Rock')
my_list.extend(my_new_list)
my_list1[3][2]
print(my_list)
print(my_list1[3][2])

[1, 3, 6, 9, 'Rock', 4, 5, 6, 7, 8]
6

In [16]:
my_list.remove(6)
print(my_list)

[1, 3, 9, 'Rock', 4, 5, 6, 7, 8]

In [17]:
del my_list[2]
my_list

[1, 3, 'Rock', 4, 5, 6, 7, 8]

Tuples

In [18]:
a = (5,'python',[1,2,3], 27.9,5)
print(a)
print(type(a))
print(a[2][2])

(5, 'python', [1, 2, 3], 27.9, 5)
<class 'tuple'>
3

In [19]:
list1=[1,2,3]
tuple1=tuple(list1)
print(tuple1)

(1, 2, 3)

In [20]:
#tuple is immutable
#a[2]=0

Sets

In [21]:
z={1,2,3,'ngisog',4.5}
print(z)

#sets dont preserve order
#sets are immutable

{1, 2, 3, 4.5, 'ngisog'}

In [22]:
z[3]

TypeError: 'set' object is not subscriptable

In [23]:
#Adding elements
my_set = {1,3}
print(my_set)

my_set.add(8)
print(my_set)

my_set.update([6,8,1,4,2])
print(my_set)

#deleting elements
my_set.remove(6)
print(my_set)

{1, 3}
{8, 1, 3}
{1, 2, 3, 4, 6, 8}
{1, 2, 3, 4, 8}

In [24]:
#Union and intersection

A = [1, 2, 3, 4, 5,9]
B = (4, 5, 6, 7, 8,10)

seta=set(A)
setb=set(B)

print(seta.union(setb))
print(seta.intersection(setb))

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
{4, 5}

Dictionaries

In [25]:
dict={1:'a',2:'v'}
#here{1-Key:'a'-Value}
print(dict)

{1: 'a', 2: 'v'}

In [26]:
dict={"name":("asd","dsd","grg"),"age":(2,4,5),'id':[34,5.6,56]}
print(dict)
print(dict["name"][1],dict['id'][0])
print(dict['name'])

{'name': ('asd', 'dsd', 'grg'), 'age': (2, 4, 5), 'id': [34, 5.6, 56]}
dsd 34
('asd', 'dsd', 'grg')

In [27]:
my_d={"Name":"Nikita","age":27}
my_d['age'] = 12
print(my_d)

my_d['address'] = 'Mumbai'
print(my_d)

{'Name': 'Nikita', 'age': 12}
{'Name': 'Nikita', 'age': 12, 'address': 'Mumbai'}

In [28]:
my_d.values()

dict_values(['Nikita', 12, 'Mumbai'])

In [29]:
my_d.keys()

dict_keys(['Name', 'age', 'address'])

Numpy

In [30]:
import numpy as np

In [31]:
a=np.array([1,2,3,4])
print(a)
print(type(a))

[1 2 3 4]
<class 'numpy.ndarray'>

In [32]:
a=np.array([(1,2,3),(4,5,6),(7,8,9)])
print(a)
print(a.ndim)
print(a.shape)

[[1 2 3]
 [4 5 6]
 [7 8 9]]
2
(3, 3)

In [33]:
print(np.ones((2,3)))
print(np.zeros((4,5)))
print(np.full((5,5),3.6))
print(np.identity(4))

[[1. 1. 1.]
 [1. 1. 1.]]
[[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]
[[3.6 3.6 3.6 3.6 3.6]
 [3.6 3.6 3.6 3.6 3.6]
 [3.6 3.6 3.6 3.6 3.6]
 [3.6 3.6 3.6 3.6 3.6]
 [3.6 3.6 3.6 3.6 3.6]]
[[1. 0. 0. 0.]
 [0. 1. 0. 0.]
 [0. 0. 1. 0.]
 [0. 0. 0. 1.]]

In [34]:
a= np.linspace(1,10,5)
print(a)

a=np.arange(100,39,-2)
print(a)

a=np.random.random((3,4))
print(a)


a=np.random.randint(50,101,(10,10))
print(a)
print(a.shape)

[ 1.    3.25  5.5   7.75 10.  ]
[100  98  96  94  92  90  88  86  84  82  80  78  76  74  72  70  68  66
  64  62  60  58  56  54  52  50  48  46  44  42  40]
[[0.34514773 0.34806562 0.67547783 0.00379545]
 [0.43762455 0.16047908 0.55611584 0.06994452]
 [0.8289922  0.17513278 0.368424   0.84800303]]
[[ 97  84  65  76  52  79  69  87  60  80]
 [ 63  77  84  81  72  78  50  88  71  92]
 [ 82  68  99  87  76  54  97  52  94  84]
 [ 83  69  69  83  75  65  84  85  88  87]
 [ 65  82  92  93  93  59  94  93  68  97]
 [100  86  58  77  97  59  66  53  77  58]
 [ 56  62  84  85  91  92  74  59  95  60]
 [ 51  78  63  50  55  87  86  94  57  97]
 [ 62  84  68  54  58  95  95  81  98  69]
 [ 55  66  71  67  61 100  96  57  70  51]]
(10, 10)

In [35]:
a=np.random.uniform(50.4,100,(2,3))
print(a)

[[66.49517233 71.27596942 96.64675319]
 [66.41371733 82.69146537 73.08929182]]

In [36]:
#indexing and slicing
a=np.array([(1,2,3,4),(3,4,5,6),(8,9,10,11)])

print(a)
print(a[0,2])
print(a[:,2])
print(a[0:2,:])

[[ 1  2  3  4]
 [ 3  4  5  6]
 [ 8  9 10 11]]
3
[ 3  5 10]
[[1 2 3 4]
 [3 4 5 6]]

In [37]:
#aggregate functions
a=np.array([(8,9),(10,11),(12,13)])
print(a.min())
print(a.max())
print(a.mean())
print(a.sum())
print(np.mean(a))

8
13
10.5
63
10.5

In [38]:
x=np.array([(1,2),(3,4)])
y=np.array([(5,6),(7,8)])

print(x)
print(y)
print(x+y)#addition
print(x-y)#subtraction
print(x*y)#multiplication
print(x/y)#divide
print(x%y)#reminder
#print(x@y)#matrix-multiplication

print(np.dot(x,y))
#print(np.add(x,y))
#np.add(), np.subtract(), np.multiply(), np.divide(), np.remainder()

[[1 2]
 [3 4]]
[[5 6]
 [7 8]]
[[ 6  8]
 [10 12]]
[[-4 -4]
 [-4 -4]]
[[ 5 12]
 [21 32]]
[[0.2        0.33333333]
 [0.42857143 0.5       ]]
[[1 2]
 [3 4]]
[[19 22]
 [43 50]]

In [39]:
#arrays are mutable
x= np.array([(1,2,3),(3,4,5)])
x[0,1]=7
print(x)

[[1 7 3]
 [3 4 5]]

## pandas

In [1]:
import pandas as pd

### series

In [2]:
import numpy as np

data=np.array([101,102,103,104])
s= pd.Series(data)
print(s)
print()
print(s[1])
s[1]=100
s[6]=105
print(s)

0    101
1    102
2    103
3    104
dtype: int32

102
0    101
1    100
2    103
3    104
6    105
dtype: int64

In [3]:
# data={'a':0,'b':1,'c':2.78}  #this is a dictionery
s=pd.Series(data)
print(s)
print()
print(s[0])
print(s[-2:])
s[1]=1001
print(s)

0    101
1    100
2    103
3    104
dtype: int32

101
2    103
3    104
dtype: int32
0     101
1    1001
2     103
3     104
dtype: int32

# Dataframes

In [4]:
data= (['amit',40],['shreya',30],['fenil',76])
df= pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    amit   40
1  shreya   30
2   fenil   76

In [5]:
data={'Name':['shrey','rushil','parth','re'],'Age':[40,39,60,69]}
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
df

         Name  Age
rank1   shrey   40
rank2  rushil   39
rank3   parth   60
rank4      re   69

In [6]:
a=df['Name']
print(type(a))
a

<class 'pandas.core.series.Series'>

rank1     shrey
rank2    rushil
rank3     parth
rank4        re
Name: Name, dtype: object

In [7]:
b=df[['Name','Age']]
b

         Name  Age
rank1   shrey   40
rank2  rushil   39
rank3   parth   60
rank4      re   69

In [8]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [9]:
#df.loc[inclusive:inclusive]
#df.iloc[inclusive:exclusive]

#df.loc['rank2']
#df.loc['rank1':'rank3']
#df.loc['rank1':'rank4',['Name','Age']]

#df.iloc[0:2]
df.iloc[:,[0]]

         Name
rank1   shrey
rank2  rushil
rank3   parth
rank4      re

In [10]:
#adding a column
df['address']=["Mumbai","Pune",'uchicchi','Ahmedabad']
df

         Name  Age    address
rank1   shrey   40     Mumbai
rank2  rushil   39       Pune
rank3   parth   60   uchicchi
rank4      re   69  Ahmedabad

In [11]:
#interchanging the columns
df=df[['Name', 'address','Age']]
df

#X1 X2 Y X3 X4
#X1 X2 X3 X4 Y

         Name    address  Age
rank1   shrey     Mumbai   40
rank2  rushil       Pune   39
rank3   parth   uchicchi   60
rank4      re  Ahmedabad   69

In [12]:
df["Newcol"]=[5,10,12,69]
print(df)

df["Revised_Col"]=df["Newcol"]*2
print(df)

         Name    address  Age  Newcol
rank1   shrey     Mumbai   40       5
rank2  rushil       Pune   39      10
rank3   parth   uchicchi   60      12
rank4      re  Ahmedabad   69      69
         Name    address  Age  Newcol  Revised_Col
rank1   shrey     Mumbai   40       5           10
rank2  rushil       Pune   39      10           20
rank3   parth   uchicchi   60      12           24
rank4      re  Ahmedabad   69      69          138

<ipython-input-12-c38505ad16a6>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Newcol"]=[5,10,12,69]
<ipython-input-12-c38505ad16a6>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Revised_Col"]=df["Newcol"]*2

In [13]:
#deleting a column
del df["Newcol"]
print(df)

         Name    address  Age  Revised_Col
rank1   shrey     Mumbai   40           10
rank2  rushil       Pune   39           20
rank3   parth   uchicchi   60           24
rank4      re  Ahmedabad   69          138

In [14]:
#df=df.drop('rank1',axis=0)
#df=df.drop(['Revised_Col'],axis=1)
df
#axis=0-->rows (default)
#axis=1-->cols

         Name    address  Age  Revised_Col
rank1   shrey     Mumbai   40           10
rank2  rushil       Pune   39           20
rank3   parth   uchicchi   60           24
rank4      re  Ahmedabad   69          138

In [15]:
df.drop(df[(df.Name=='re')|(df.Age==601)].index)

         Name   address  Age  Revised_Col
rank1   shrey    Mumbai   40           10
rank2  rushil      Pune   39           20
rank3   parth  uchicchi   60           24

In [16]:
df

         Name    address  Age  Revised_Col
rank1   shrey     Mumbai   40           10
rank2  rushil       Pune   39           20
rank3   parth   uchicchi   60           24
rank4      re  Ahmedabad   69          138

In [17]:
#df.to_csv(r"C:\Users\Admin\nikita-python\sampledf.csv",index=True,header=True)

In [18]:
#df.to_excel("sample.xlsx",index=False,header=True)

In [19]:
import os
os.getcwd()

'C:\\Users\\hp\\jupterprojects'

In [20]:
#df = pd.read_csv(r'C:\Users\Admin\nikita-python\sampledf.csv', index_col=0,header=0)
df

         Name    address  Age  Revised_Col
rank1   shrey     Mumbai   40           10
rank2  rushil       Pune   39           20
rank3   parth   uchicchi   60           24
rank4      re  Ahmedabad   69          138